using MaktabAhvaz.Infrastructure.Data;
using Microsoft.EntityFrameworkCore;

var builder = WebApplication.CreateBuilder(args);


// =========================================================
// CONTROLLERS
// =========================================================

builder.Services.AddControllers();


// =========================================================
// OPEN API
// =========================================================

builder.Services.AddOpenApi();


// =========================================================
// DATABASE
// =========================================================

builder.Services.AddDbContext<ApplicationDbContext>(options =>
{
    options.UseSqlServer(
        builder.Configuration.GetConnectionString(
            "DefaultConnection"));
});


// =========================================================
// APPLICATION
// =========================================================

var app = builder.Build();


// =========================================================
// HTTP PIPELINE
// =========================================================

if (app.Environment.IsDevelopment())
{
    app.MapOpenApi();
}


// =========================================================
// HTTPS
// =========================================================

app.UseHttpsRedirection();


// =========================================================
// STATIC FILES
// =========================================================

// برای فایل‌های قدیمی که هنوز داخل wwwroot
// خود API قرار دارند.
//
// مسیر پیش‌فرض:
// {API_ROOT}\wwwroot
//
// فایل‌هایی مثل:
// /uploads/audio/file.mp3
// همچنان از اینجا سرو می‌شوند.

app.UseStaticFiles();


// =========================================================
// AUTHORIZATION
// =========================================================

app.UseAuthorization();


// =========================================================
// API CONTROLLERS
// =========================================================

app.MapControllers();


// =========================================================
// RUN
// =========================================================

app.Run();